/* Создать массив [5][7]. Инициализируем числами от 0 до 35:
- при помощи списка инициализаторов;
- в цикле;
- с использованием вложенного цикла.
*/

#include <stdio.h>

int main()
{
    const int N = 5; 
    const int M = 7;
    
    //Список инициализаторов
    int ar1[5][7] = { {0,1,2,3,4,5,6},
                     {7,8,9,10,11,12,13},
                     {14,15,16,17,18,19,20},
                     {21,22,23,24,25,26,27},
                     {28,29,30,31,32,33,34}
                    };
    printf("Результат инициализации массива ar1 списком инициализаторов:\n");
    for (int i = 0; i < N; ++i) {
        for (int j = 0; j < M; ++j) {
            printf("%3d", ar1[i][j]);
        }
        printf("\n");
    }
    
    //Цикл
    int ar2[N][M];
    int *pAr2 = ar2[0];
    
    for (int i = 0; i < N * M; ++i) {
        *pAr2 = i;
        ++pAr2;
    }
    
    printf("\nРезультат заполнения массива ar2 в цикле:\n");
    for (int i = 0; i < N; ++i) {
        for (int j = 0; j < M; ++j) {
            printf("%3d", ar1[i][j]);
        }
        printf("\n");
    }
    
    //Вложенный цикл
    int ar3[N][M];
    int value = 0;
    
    printf("\nРезультат заполнения массива ar3 с использованием вложенного цикла:\n");
    for (int i = 0; i < N; ++i) {
        for (int j = 0; j < M; ++j) {
            ar3[i][j] = value;
            printf("%3d", ar3[i][j]);
            ++value;
        }
        printf("\n");
    }
    
    return 0;
}
